; domain
; Guy - ECE final project


(define (domain task_alloc) 
	(:requirements :strips :typing)
	(:types city place physobj - object
            package vehicle - physobj
            truck airplane - vehicle
            airport location - place)
;;(:constants 
;;	)
	(:predicates (in-city ?loc - place ?city - city)
                 (at ?obj - physobj ?loc - place)
                 (in ?pkg - package ?veh - vehicle))
	(:action load-truck
         :parameters (?pkg - package ?truck - truck ?loc - place)
         :precondition (and (at ?truck ?loc) (at ?pkg ?loc))
         :effect (and (not (at ?pkg ?loc)) (in ?pkg ?truck)) )
	(:action load-airplane
         :parameters (?pkg - package ?airplane - airplane ?loc - place)
         :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
         :effect (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)) )
	(:action unload-truck
         :parameters (?pkg - package ?truck - truck ?loc - place)
         :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
         :effect (and (not (in ?pkg ?truck)) (at ?pkg ?loc)) )
	(:action unload-airplane
         :parameters (?pkg - package ?airplane - airplane ?loc - place)
         :precondition (and (in ?pkg ?airplane) (at ?airplane ?loc))
         :effect (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)) )
	(:action fly-airplane
         :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
         :precondition (at ?airplane ?loc-from)
         :effect (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to))  )
	(:action drive-truck
         :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
         :precondition (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
         :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)) )

)

; problem
(define (problem task1) 
	(:domain task_alloc)
	(:objects plane - airplane
          truck - truck
          cdg lhr - airport
          south north - location
          paris london - city
          p1 p2 - package)
	(:init (in-city cdg paris)
       (in-city lhr london)
       (in-city north paris)
       (in-city south paris)
       (at plane lhr)
       (at truck cdg)
       (at p1 lhr)
       (at p2 lhr) )
	(:goal (and (at p1 north) 
            (at p2 south)) )
)

; plan
1. (load-airplane p1 plane lhr)
   deleted: (at p1 lhr)
   added: (in p1 plane)
   goals met: 0 of 2
2. (load-airplane p2 plane lhr)
   deleted: (at p2 lhr)
   added: (in p2 plane)
   goals met: 0 of 2
3. (fly-airplane plane lhr cdg)
   deleted: (at plane lhr)
   added: (at plane cdg)
   goals met: 0 of 2
4. (unload-airplane p1 plane cdg)
   deleted: (in p1 plane)
   added: (at p1 cdg)
   goals met: 0 of 2
5. (load-truck p1 truck cdg)
   deleted: (at p1 cdg)
   added: (in p1 truck)
   goals met: 0 of 2
6. (unload-airplane p2 plane cdg)
   deleted: (in p2 plane)
   added: (at p2 cdg)
   goals met: 0 of 2
7. (load-truck p2 truck cdg)
   deleted: (at p2 cdg)
   added: (in p2 truck)
   goals met: 0 of 2
8. (drive-truck truck cdg south paris)
   deleted: (at truck cdg)
   added: (at truck south)
   goals met: 0 of 2
9. (unload-truck p2 truck south)
   deleted: (in p2 truck)
   added: (at p2 south)
   goals met: 1 of 2
10. (drive-truck truck south north paris)
   deleted: (at truck south)
   added: (at truck north)
   goals met: 1 of 2
11. (unload-truck p1 truck north)
   deleted: (in p1 truck)
   added: (at p1 north)
   goals met: 2 of 2
